{
    "title": "Глобальные настройки",
    "description": "Настройте глобальные параметры Вашего экземпляра Booklore, включая обработку обложек, параметры поиска и ограничения загрузки файлов.",
    "covers": {
        "sectionTitle": "Обложки книг",
        "regenerate": "Перегенерация обложек",
        "regenerateBtn": "Перегенерировать",
        "regenerateDesc": "Перегенерирует обложки для всех книг из встроенных обложек в файлах.",
        "regenerateStarted": "Перегенерация обложек запущена",
        "regenerateStartedDetail": "Обложки книг перегенерируются.",
        "regenerateError": "Не удалось запустить перегенерацию обложек.",
        "verticalCropping": "Вертикальная обрезка обложек",
        "verticalCroppingDesc": "Автоматически обрезать чрезмерно высокие изображения (как веб-комиксы) сверху для создания пригодных миниатюр обложек.",
        "horizontalCropping": "Горизонтальная обрезка обложек",
        "horizontalCroppingDesc": "Автоматически обрезать чрезмерно широкие изображения слева для создания пригодных миниатюр обложек.",
        "aspectRatio": "Порог соотношения сторон: {{value}}",
        "aspectRatioDesc": "Изображения, соотношение сторон которых превышает этот порог, будут обрезаны. Значение 2.5 означает, что изображения более чем в 2.5 раза выше (или шире) нормы будут обрезаны.",
        "smartCropping": "Умная обрезка",
        "smartCroppingDesc": "Пропускать однотонные области при определении места обрезки. Фокусирует обложку на наиболее значимом содержании."
    },
    "search": {
        "sectionTitle": "Поиск и рекомендации",
        "autoBookSearch": "Автоматический поиск книг",
        "autoBookSearchDesc": "Автоматически пытается сопоставить метаданные при открытии панели информации о книге.",
        "similarBook": "Рекомендации похожих книг",
        "similarBookDesc": "Включает или отключает рекомендации похожих книг на основе Вашей библиотеки."
    },
    "fileManagement": {
        "sectionTitle": "Управление файлами",
        "maxUploadSize": "Максимальный размер загружаемого файла",
        "maxUploadPlaceholder": "Макс. размер",
        "maxUploadDesc": "Определяет максимально допустимый размер (в МБ) для каждого загружаемого файла. Применяется к форматам EPUB, PDF, CBZ, CBR и CB7.",
        "restartWarning": "Изменения вступят в силу после перезапуска сервера",
        "invalidInput": "Неверные данные",
        "invalidInputDetail": "Пожалуйста, введите корректный максимальный размер файла в МБ."
    },
    "telemetry": {
        "sectionTitle": "Телеметрия",
        "enableTelemetry": "Включить телеметрию",
        "telemetryDesc": "Помогите улучшить Booklore, делясь анонимной статистикой использования. Эти данные позволяют разработчикам видеть, какие функции наиболее востребованы, выявлять ошибки и обнаруживать проблемы с производительностью, чтобы знать, над чем работать дальше. Личная информация, содержание книг и любые идентифицирующие данные никогда не передаются. Данные отправляются на сервер Booklore автоматически раз в 24 часа. Это полностью безопасно и очень полезно для разработчиков."
    },
    "settingsSaved": "Настройки сохранены",
    "settingsSavedDetail": "Настройки были успешно сохранены!",
    "settingsError": "Произошла ошибка при сохранении настроек."
}
